In [ ]:
# Modify the DataFrame to keep only height and weight columns
fifa_transpose = fifa_players.set_index('name')[['height','weight']]

In [ ]:
#using pivot
df.pivot(index='Year',columns='Name',values='Weight')

In [ ]:
# Discard the fifth row to delete all repeated rows
fifa_drop = fifa_players.drop(4, axis=0)

# Use pivot method to get all scores by name and movement
fifa_pivot = fifa_drop.pivot(index='name', columns='movement') 

# Print fifa_pivot
print(fifa_pivot)  

# Use pivot table to get all scores by name and movement
fifa_pivot_table = fifa_players.pivot_table(index='name', 
                                     columns='movement', 
                                     aggfunc='mean')
# Print fifa_pivot_table
print(fifa_pivot_table)

In [ ]:
# Use pivot table to show the count of players by club and nationality and the total count
players_country = fifa_players.pivot_table(index='nationality', 
                                    columns='club', 
                                    values='name', 
                                    aggfunc='count', 
                                    margins=True)

In [ ]:
# Set the argument to get the maximum for each row and column
fifa_mean = fifa_players.pivot_table(index=['nationality', 'club'], 
                                     columns='year', 
                                     aggfunc='max', 
                                     margins=True)

In [ ]:
# Melt rating and rating_count columns using title and authors as identifier
books_melted = books_gothic.melt(id_vars=['title','authors'], 
                                 value_vars=['rating', 'rating_count'])

In [ ]:
# Assign the name number to the new column containing the values
books_ratings = books_gothic.melt(id_vars=['title', 'authors', 'publisher'], 
                                  value_vars=['rating', 'rating_count'], 
                                  var_name='feature', 
                                  value_name='number')

In [ ]:
# Reshape wide to long using title as index and version as new name, and extracting isbn prefix 
isbn_long = pd.wide_to_long(golden_age, 
                    stubnames=['isbn'], 
                    i='title', 
                    j='version')

In [ ]:
# Specify that wide columns have a suffix containing words
the_code_long = pd.wide_to_long(books_brown, 
                                stubnames=['language', 'publisher'], 
                                i=['author', 'title'], 
                                j='code', 
                                sep='_', 
                                suffix='\w+')

In [ ]:
# Modify books_hunger by resetting the index without dropping it
books_hunger.reset_index(drop=False, inplace=True)

# Reshape using title and language as index, feature as new name, publication and page as prefix separated by space and ending in a word
publication_features = pd.wide_to_long(books_hunger, 
                                       stubnames=['publication','page'], 
                                       i=['title','language'], 
                                       j='feature', 
                                       sep=' ', 
                                       suffix='\w+')

In [ ]:
#splitting into two columns
#working with strings
books[['main_title','subtitle']] =books['title'].str.split(":", expand=True)
books.drop('title', axis=1, inplace=True)
pd.wide_to_long(books, stubnames=['ratings','sold'],
               i=['main_title','subtitle'],
               j='year')

In [ ]:
#concatenate two columns
books_new['name_author'].str.cat(books_new['lastname_author'], sep=" ")

In [ ]:
# Split by the hyphen the index of books_dys
books_dys.index = books_dys.index.str.split('-').str.get(0)

# Concatenate the index with the list author_list separated by a hyphen
books_dys.index = books_dys.index.str.cat(author_list, sep="-")

In [ ]:
# Concatenate the title and subtitle separated by "and" surrounded by spaces
hp_books['full_title'] = hp_books['title'].str.cat(hp_books['subtitle'], sep =" and ") 

# Split the authors into writer and illustrator columns
hp_books[['writer', 'illustrator']] = hp_books['authors'].str.split('/', expand=True)

# Melt goodreads and amazon columns into a single column
hp_melt = hp_books.melt(id_vars=['full_title','writer'], 
                        var_name='source', 
                        value_vars=['goodreads',"amazon"], 
                        value_name='rating')

In [ ]:
# Split main_title by a colon and assign it to two columns named title and subtitle 
books_sh[['title', 'subtitle']] = books_sh['main_title'].str.split(':', expand=True)

# Split version by a space and assign the second element to the column named volume 
books_sh['volume'] = books_sh['version'].str.split(' ').str.get(1)

# Drop the main_title and version columns modifying books_sh
books_sh.drop(['main_title', 'version'], axis=1, inplace=True)

# Reshape using title, subtitle and volume as index, name feature the new variable from columns starting with number, separated by undescore and ending in words 
sh_long = pd.wide_to_long(books_sh, stubnames=['number'], i=['title', 'subtitle','volume'], 
                  j='feature', sep="_", suffix='\w+')

In [ ]:
new_array = [['yes','no','yes'],['no','yes','yes']]
churn.index= pd.MultiIndex.from_arrays(new_array,names=['member','credit_card'])

In [ ]:
# Predefined list to use as index
new_index = [['California', 'California', 'New York', 'Ohio'], 
             ['Los Angeles', 'San Francisco', 'New York', 'Cleveland']]

# Create a multi-level index using predefined new_index
churn_new = pd.MultiIndex.from_arrays(new_index, names=['state', 'city'])

# Assign the new index to the churn index
churn.index = churn_new

# Reshape by stacking churn DataFrame
churn_stack = churn.stack()

In [ ]:
# Set state and city as index modifying the DataFrame
churn.set_index(['state', 'city'], inplace=True)

# Reshape by stacking the second level
churn_stack = churn.stack(level=1)

In [ ]:
# Stack country level, group by country and get the median 
obesity_median = obesity.stack(level='country').groupby('country').median()

In [ ]:
#list-like columns
cities_explode = cities['zip_code'].explode()
cities[['city', 'country']].merge(cities_explode, left_index=True, right_index=True)

#shorter code
cities_explode = cities.explode('zip_code')

In [ ]:
#exploding non lists
#chaining operations
cities.assign(zip_code=cities['zip_code'].str.split(',')).explode('zip_code')

In [ ]:
# Transform the list-like column named bounds  
obesity_explode = obesity.explode('bounds')

# Modify obesity_explode by resetting the index 
obesity_explode.reset_index(drop=True, inplace=True)

# Print obesity_explode
print(obesity_explode)

In [ ]:
# Assign the result of the split to the bounds column
obesity_split = obesity.assign(bounds=obesity['bounds'].str.split('-'))

# Transform the column bounds in the obesity DataFrame
obesity_split = obesity.assign(bounds=obesity['bounds'].str.split('-')).explode('bounds')

In [2]:
writers = [
    {
        "first":'Mary',
        "last":"Shelley",
        "books":{"title":"Frankenstein","year":1818}
    },
    {
        "first":'Ernest',
        "last":"Hemingway",
        "books":{"title":"The Old Man and the Sea","year":1951}
    }
]

from pandas import json_normalize
json_normalize(writers)

    first       last              books.title  books.year
0    Mary    Shelley             Frankenstein        1818
1  Ernest  Hemingway  The Old Man and the Sea        1951

In [3]:
writers_norm = json_normalize(writers, sep='_')
writers_norm

    first       last              books_title  books_year
0    Mary    Shelley             Frankenstein        1818
1  Ernest  Hemingway  The Old Man and the Sea        1951

In [5]:
import pandas as pd
pd.wide_to_long(writers_norm, stubnames=['books'], i=['first','last'],j='feature',sep='_', suffix='\w+')

                                            books
first  last      feature
Mary   Shelley   title               Frankenstein
                 year                        1818
Ernest Hemingway title    The Old Man and the Sea
                 year                        1951

In [10]:
writers1 = [
    {
        "first":'Mary',
        "last":"Shelley",
        "books":[{"title":"Frankenstein","year":1818},
                {"title":"Mathilda","year":1819},
                {"title":"The last man","year":1826}]
    },
    {
        "first":'Ernest',
        "last":"Hemingway",
        "books":[{"title":"The Old Man and the Sea","year":1951},
                {"title":"The Sun Also Rises","year":1927}]
    }
]

json_normalize(writers1)

    first       last                                              books
0    Mary    Shelley  [{'title': 'Frankenstein', 'year': 1818}, {'ti...
1  Ernest  Hemingway  [{'title': 'The Old Man and the Sea', 'year': ...

In [7]:
#above is not flattened out yet, use recod_path
json_normalize(writers1, record_path='books')

                     title  year
0             Frankenstein  1818
1                 Mathilda  1819
2             The last man  1826
3  The Old Man and the Sea  1951
4       The Sun Also Rises  1927

In [12]:
#include meta - tells pandas what columns to record
json_normalize(writers1, record_path='books', meta=['first','last'])

                     title  year   first       last
0             Frankenstein  1818    Mary    Shelley
1                 Mathilda  1819    Mary    Shelley
2             The last man  1826    Mary    Shelley
3  The Old Man and the Sea  1951  Ernest  Hemingway
4       The Sun Also Rises  1927  Ernest  Hemingway

In [ ]:
# Import the json_normalize function
from pandas import json_normalize

# Normalize movies and separate the new columns with an underscore 
movies_norm = json_normalize(movies, sep='_')

# Reshape using director and producer as index, create movies from column starting from features
movies_long = pd.wide_to_long(movies_norm, stubnames='features', 
                      i=['director', 'producer'], j='movies', 
                      sep='_', suffix='\w+')

In [16]:
movies = [
    {'director': 'Woody Allen',
     'producer': 'Letty Aronson',
     'features': [{'title': 'Magic in the Moonlight', 'year': 2014},
                  {'title': 'Vicky Cristina Barcelona', 'year': 2008},
                  {'title': 'Midnight in Paris', 'year': 2011}]},
    {'director': 'Niki Caro',
     'producer': 'Jason Reed',
     'features': [{'title': 'Mulan', 'year': 2020}]}]

In [19]:
movies_norm = json_normalize(movies, record_path='features', meta=['director', 'producer'])
print(movies_norm)

                      title  year     director       producer
0    Magic in the Moonlight  2014  Woody Allen  Letty Aronson
1  Vicky Cristina Barcelona  2008  Woody Allen  Letty Aronson
2         Midnight in Paris  2011  Woody Allen  Letty Aronson
3                     Mulan  2020    Niki Caro     Jason Reed

In [25]:
writers = ['Mary Shelley', 'Ernest Hemingway']
books = ['{"title":"Frankenstein","year":"1818"}',
        '{"title":"The Old Man and the Sea","year":"1951"}']
cols = pd.DataFrame(dict(writers=writers, books=books))
cols

            writers                                              books
0      Mary Shelley             {"title":"Frankenstein","year":"1818"}
1  Ernest Hemingway  {"title":"The Old Man and the Sea","year":"1951"}

In [21]:
import json
books = cols['books'].apply(json.loads).apply(pd.Series)
books

                     title  year
0             Frankenstein  1818
1  The Old Man and the Sea  1951

In [22]:
cols = cols.drop(columns='books')
pd.concat([cols,books],axis=1)

            writers                    title  year
0      Mary Shelley             Frankenstein  1818
1  Ernest Hemingway  The Old Man and the Sea  1951

In [27]:
#dumping nested data
books = cols['books'].apply(json.loads).to_list()
books_dump = json.dumps(books)
new_books = pd.read_json(books_dump)
pd.concat([cols['writers'], new_books], axis=1)

            writers                    title  year
0      Mary Shelley             Frankenstein  1818
1  Ernest Hemingway  The Old Man and the Sea  1951

In [34]:
names=['Killdeer', 'Chipping Sparrow', 'Cedar Waxwing']
bird_facts = ['{"Size" : "Large", "Color": "Golden brown", "Behavior": "Runs swiftly along ground", "Habitat": "Rocky areas"}',
 '{"Size":"Small", "Color": "Gray-white", "Behavior": "Often in flocks", "Habitat": "Open woodlands"}',
 '{"Size":"Small", "Color": "Gray-brown", "Behavior": "Catch insects over open water", "Habitat": "Parks"}']
birds = pd.DataFrame(dict(names=names, bird_facts=bird_facts))
birds

              names                                         bird_facts
0          Killdeer  {"Size" : "Large", "Color": "Golden brown", "B...
1  Chipping Sparrow  {"Size":"Small", "Color": "Gray-white", "Behav...
2     Cedar Waxwing  {"Size":"Small", "Color": "Gray-brown", "Behav...

In [30]:
data_split = birds['bird_facts'].apply(json.loads).apply(pd.Series)
data_split

    Size         Color                       Behavior         Habitat
0  Large  Golden brown      Runs swiftly along ground     Rocky areas
1  Small    Gray-white                Often in flocks  Open woodlands
2  Small    Gray-brown  Catch insects over open water           Parks

In [31]:
birds.drop(columns='bird_facts', inplace=True)
birds

              names
0          Killdeer
1  Chipping Sparrow
2     Cedar Waxwing

In [32]:
birds = pd.concat([birds,data_split], axis=1)
birds

,names,Size,Color,Behavior,Habitat
0,Killdeer,Large,Golden brown,Runs swiftly along ground,Rocky areas
1,Chipping Sparrow,Small,Gray-white,Often in flocks,Open woodlands
2,Cedar Waxwing,Small,Gray-brown,Catch insects over open water,Parks

In [40]:
#dumping nests
bird_facts = birds['bird_facts'].apply(json.loads).to_list()
#conver bird_facts into a json
bird_dump = json.dumps(bird_facts)
bird_df = pd.read_json(bird_dump)
bird_final = pd.concat([birds['names'], bird_df], axis=1 )
bird_final

,names,Size,Color,Behavior,Habitat
0,Killdeer,Large,Golden brown,Runs swiftly along ground,Rocky areas
1,Chipping Sparrow,Small,Gray-white,Often in flocks,Open woodlands
2,Cedar Waxwing,Small,Gray-brown,Catch insects over open water,Parks